---
type: HostObjectUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# HostObjectUtils

`Autodesk.Revit.DB.HostObjectUtils` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetBottomFaces | 2012 | `public static IList < Reference > GetBottomFaces ( HostObject hostObject )` |
| Method | GetSideFaces | 2012 | `public static IList < Reference > GetSideFaces ( HostObject hostObject , ShellLayerType side )` |
| Method | GetTopFaces | 2012 | `public static IList < Reference > GetTopFaces ( HostObject hostObject )` |